import re


def test_date_regex():
    pattern = r'[\d]{4}年[\d]+月[\d]+日'

    date_sentences = [
        "2017年9月16号",
        "2017年10月3日",
        "2015年7月",
        "9月17号",
        "4月15",
        "6号",
        "星期3",
        "下礼拜5",
        "本周2",
        "周末",
        "下周星期5",
        "星期天",
        "2015-9-7",
        "9-7",
        "2019.9.8",
        "2019.8",
        "9.7",
        "二零一六年九月十八号",
        "三月七号",
        "十月二十",
        "星期六",
        "下礼拜五,我打算回上海",
        "今天十五号,明天十六号",
        "十月一号国庆节,我们打算回家",
        "下午12:56",
        "9:30",
        "09:31",
        "上午七点",
        "下午5点",
        "十点半",
        "今天晚上九点15",
        "十点一刻",
        "二十三点50",
        "十一点"
    ]

    assert not not re.match(pattern, '2021年5月4日')
    assert not re.match(pattern, '2020年5月')
    assert not re.match(pattern, '20211年5月4日')
